h1994st/sec_eth_mpc5748g/SDK/middleware/tcpip/wolfssl/wolfcrypt/src/random.c
#elif defined(NXP_SDK_HSM)

    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        int ret = -1;
        word32 i = 0;
        word32 remaining = sz;
        byte* outp = output;
        uint8_t buf[16];

        (void)os;

        do
        {
            ret = HSM_DRV_GenerateRND(buf, HSM_TIMEOUT);
            if (ret != STATUS_SUCCESS)
            {
                break;
            }
            for(i = 0; (i < sizeof(buf)) && (remaining > 0); i++)
            {
                *outp++ = buf[i];
                remaining--;
            }
        }
        while (remaining > 0);

        return ret;
    }

#elif defined(NXP_SDK_CSEC)

    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        int ret = -1;
        word32 i = 0;
        word32 remaining = sz;
        byte* outp = output;
        uint8_t buf[16];

        (void)os;

        do
        {
            ret = CSEC_DRV_GenerateRND(buf);
            if (ret != STATUS_SUCCESS)
            {
                break;
            }
            for(i = 0; (i < sizeof(buf)) && (remaining > 0); i++)
            {
                *outp++ = buf[i];
                remaining--;
            }
        }
        while (remaining > 0);

        return ret;
    }

#elif defined(NXP_SDK_CSE)
    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        int ret = -1;
        word32 i = 0;
        word32 remaining = sz;
        byte* outp = output;
        uint8_t buf[16];

        (void)os;

        do
        {
            ret = CSE_DRV_GenerateRND(buf,10);
            if (ret != STATUS_SUCCESS)
            {
                break;
            }
            for(i = 0; (i < sizeof(buf)) && (remaining > 0); i++)
            {
                *outp++ = buf[i];
                remaining--;
            }
        }
        while (remaining > 0);

        return ret;
    }

#elif defined(NXP_SDK_HSE)
    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        (void)os;
        (void)output;
        (void)sz;

        return 0;
    }

#elif defined (NXP_SDK_OSIF)

    #include <stdlib.h>

    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        word32 i;
        (void) os;

        srand(S32_SysTick->CVR);

        for (i = 0; i < sz; i++) {
            output[i] = rand() % 256;
        }

        return 0;
    }

#elif defined(NO_DEV_RANDOM)

    #error "you need to write an os specific wc_GenerateSeed() here"

    /*
    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        return 0;
    }
    */

#else

    /* may block */
    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        int ret = 0;

    #ifdef HAVE_INTEL_RDSEED
        if (IS_INTEL_RDSEED(intel_flags)) {
             ret = wc_GenerateSeed_IntelRD(NULL, output, sz);
             if (ret == 0) {
                 /* success, we're done */
                 return ret;
             }
    #ifdef FORCE_FAILURE_RDSEED
             /* don't fallback to /dev/urandom */
             return ret;
    #else
             /* fallback to /dev/urandom attempt */
             ret = 0;
    #endif
        }

    #endif /* HAVE_INTEL_RDSEED */

        os->fd = open("/dev/urandom",O_RDONLY);
        if (os->fd == -1) {
            /* may still have /dev/random */
            os->fd = open("/dev/random",O_RDONLY);
            if (os->fd == -1)
                return OPEN_RAN_E;
        }

        while (sz) {
            int len = (int)read(os->fd, output, sz);
            if (len == -1) {
                ret = READ_RAN_E;
                break;
            }

            sz     -= len;
            output += len;

            if (sz) {
    #ifdef BLOCKING
                sleep(0);             /* context switch */
    #else
                ret = RAN_BLOCK_E;
                break;
    #endif
            }
        }
        close(os->fd);

        return ret;
    }

#endif

#ifdef USE_TEST_GENSEED
    #ifndef _MSC_VER
        #warning "write a real random seed!!!!, just for testing now"
    #else
        #pragma message("Warning: write a real random seed!!!!, just for testing now")
    #endif

    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        word32 i;
        for (i = 0; i < sz; i++ )
            output[i] = i;

        (void)os;

        return 0;
    }
#endif

/* End wc_GenerateSeed */

#endif /* WC_NO_RNG */
#endif /* HAVE_FIPS */
